package com.wby.thread.manythread.charector14类型信息.node8空对象.child1模拟对象与桩;

/**
 * @Auther: LangWeiXian
 * @Date: 2021/7/8 20:05
 * @Description:    空对象的逻辑变体是 模拟对象和桩 。
 *  和空对象一样，他们最终都表示在最终的程序中所使用的“实际”对象。但是，模拟对象和桩都只是假扮可以传递实际信息的存活对象，而不是像空对象那样可以
 *  成为null的一种更加智能化的替代物。
 *
 *  模拟对象和桩之间的差异主要在于程度不同。
 *      模拟对象往往是轻量级和自测试的，通常很多模拟对象被创建出来是为了处理各种不同的测试情况。
 *      桩只返回桩数据，它通常是重量级的，并且经常在测试之间被复用。
 *          桩可以根据他们被调用的方式，通过配置进行修改。
 *      因此，桩是一种复杂对象。然而对于模拟对象，如果你需要做很多事情，通常会创建大量小而简单地对象
 */
public class Text {
}
