package com.wby.thread.manythread.character19枚举类型.node12总结;

/**
 * 虽然枚举类型本身并不是特别复杂，但我还是将本章安排在全书比较靠后的位置，这是因为，程序员可以将enum与Java语言的其他功能结合使用，例如多态、泛型和反射。
 *
 * 虽然Java中的枚举比C或C++中的enum更成熟，但它仍然是一个"小"功能，Java没有它也已经（虽然有点笨拙）存在很多年了。而本章正好说明了一个"小"功能所能带来的价值。
 * 有时恰恰因为它，你才能够优雅而干净地解决问题。正如我在本书中一再强调的那样，优雅与清晰很重要，正是它们区别了成功的解决方案与失败的解决方案。而失败的解决方案就是因为其他人无法理解它。
 *
 * 关于清晰的话题，Java 1.0对术语enumeration的选择正是一个不幸的反例。对于一个专门用干从序列中选择每一个元素的对象而言，Java竟然没有使用更通用、更普遍接受的术语iterator来表示它（参见集合）。
 * 有些语言甚至将枚举的数据类型称为enumerators!Java修正了这个错误，但是Enumeration接口已经无法轻易地抹去了，因此它将一直存在于旧的（甚至有些新的）代码、类库以及文档中。
 */
public class Text {
}
